#### DATA PROCESSING 

##### FEATURE ENGINEERING

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

In [10]:
df = pd.read_csv('data/data_ids.csv')

In [ ]:
df.groupby(['date_block_num', 'shop_id', 'item_id']).agg({'item_cnt_day': 'sum'})

In [6]:
df.sort_values('item_cnt_day')

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_category_id
1057906,2013-02-11,10,12,8023,15.000000,-22.0,66
1835450,2014-10-07,18,14,20949,5.000000,-16.0,71
2048514,2014-10-10,21,12,9242,1433.333333,-9.0,8
940091,2013-10-19,9,42,3732,2599.000000,-6.0,19
59156,2013-01-18,0,12,1590,2599.000000,-6.0,29
...,...,...,...,...,...,...,...
2608034,2015-04-14,27,12,3731,1904.548077,624.0,30
2851085,2015-09-30,32,55,9249,1702.825746,637.0,8
2864229,2015-09-30,32,12,9248,1692.526158,669.0,80
2326924,2015-01-15,24,12,20949,4.000000,1000.0,71
2909812,2015-10-28,33,12,11373,0.908714,2169.0,9

In [12]:
short = df[['date_block_num', 'shop_id', 'item_id', 'item_price']]
print(short.duplicated().sum())
print(short.shape)
# df.drop_duplicates()

1196821
(2935843, 4)

In [14]:
df.groupby(['date_block_num', 'shop_id', 'item_id'])['item_price'].nunique()

date_block_num  shop_id  item_id
0               0        32         1
                         33         1
                         35         1
                         43         1
                         51         2
                                   ..
33              59       22087      1
                         22088      1
                         22091      1
                         22100      1
                         22102      1
Name: item_price, Length: 1609124, dtype: int64

In [ ]:
promedio 
desvio estandar 
distribución en número